package by.temirsultanov.ArithmeticOperations;

public class Test4 {
    //операция деления двух чисел:
    int a = 20;
    int b = 5;
    int c = a / b; // 4
    double d = 22.5 / 4.5; // 5.0
    // При делении стоит учитывать, что если в операции участвуют два целых числа,
    // то результат деления будет округляться до целого числа, даже если результат присваивается переменной float или double:

    double k = 10 / 4; // 2

    //Чтобы результат представлял число с плавающей точкой, один из операндов также должен представлять число с плавающей точкой:

    double w = 10.0 / 4; // 2.5




}
